docs/posts/2015-01-20-christmas-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Christmas Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Christmas Prayer</h1>
<p class="subtitle" role="doc-subtitle">Jan 20, 2015 00:00</p>
</header><p>
This was a prayer I delivered at NorthHaven Church in Norman for the Christmas Day service on December 25, 2011.<br>
</p>

<p>
Gracious Father,
</p>

<p>
We gather here in this place to celebrate the day the world changed.<br>
On that day, one who was pure spirit became incarnate;<br>
The eternal Word became clothed in a frail human body;<br>
That which no human had ever touched was laid by a gentle mother&rsquo;s hand into a simple manger;<br>
The eternal and timeless now had a beginning;<br>
The infinite became finite;<br>
On that day, God became human.
</p>

<p>
While still in the garden, we began to build a wall;<br>
A wall that separated ourselves from you;<br>
A wall which we built, but could never tear down.<br>
</p>

<p>
You tore down the wall when you brought your firstborn into the world,<br>
and said to that babe in the manger,<br>
</p>

<p>
&ldquo;You are my son; this day I have begotten you.&rdquo;
</p>

<p>
You have spoken to us in many ways, through the prophets, through the beauty of nature, and through the voice of conscience.
</p>

<p>
On that first Christmas day, though, you spoke has you had never spoken before.
</p>

<p>
Lord, here we are,<br>
Help us to listen,<br>
Help us to hear.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgeb30f66">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
